<?php
/**
 * 全局配置文件
 * @author 周仕林<875199116@qq.com>
 */

//数据库配置
$GLOBALS['config']['db'] = array(
    'host' => 'localhost',
    'port' => 3306,
    'username' => 'root',
    'password' => '',
    'dbname' => 'coding_spider',
    'charset' => 'utf8',
);

//地区
$GLOBALS['location'] = array(
    '北京',
    '天津',
    '河北',
    '山西',
    '内蒙古',
    '辽宁',
    '吉林',
    '黑龙江',
    '上海',
    '江苏',
    '浙江',
    '安徽',
    '福建',
    '江西',
    '山东',
    '河南',
    '湖北',
    '湖南',
    '广东',
    '广西',
    '海南',
    '重庆',
    '四川',
    '贵州',
    '云南',
    '西藏',
    '陕西',
    '甘肃',
    '青海',
    '宁夏',
    '新疆',
    '香港',
    '澳门',
    '台湾',
    '海外',
    '未知'
);